# int - integer - целое число = 0, 1, 2, 3 ...
# float - вещественное число (с плавающей точкой = дробное) = 1.2, 5.6, 1.0 ...
# str - string - строка = "хай", "да", '''нет
# и еще раз нет!'''
# bool - boolean - логический тип = True, False
# 5 != 5.0 - (!=) - не равно
# type - для проверки переменных

# Работа с числами:
# +, -, *, /, //, %, **
# 0.1 + 0.1 + 0.1 + 0.1 +0.1 + 0.1 +0.1 + 0.1 = 0.89999999999
# int + int = int (целое + целое = целое)
# float + float = float (дробное + дробное = дробное)
# int + float = float (целое + дробное = дробное): при делении возвращается float
print(2**3)